tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
tap "vvatanabe/gitb"
brew "xz"
brew "readline"
brew "awscli"
brew "bat"
brew "broot"
brew "libunistring"
brew "gettext"
brew "coreutils"
brew "curl"
brew "fd"
brew "libevent"
brew "libidn2"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "ghq"
brew "git"
brew "httpstat"
brew "jq"
brew "lazygit"
brew "libuv"
brew "libvterm"
brew "luv"
brew "mas"
brew "maven"
brew "mise"
brew "msgpack"
brew "mycli"
brew "mysql-client"
brew "unibilium"
brew "neovim"
brew "peco"
brew "pgcli"
brew "pwgen"
brew "rcm"
brew "sbt"
brew "starship"
brew "terminal-notifier"
brew "tig"
brew "tmux-xpanes"
brew "wget"
brew "vvatanabe/gitb/gitb"
cask "bitwarden"
cask "chatgpt"
cask "devtoys"
cask "discord"
cask "docker"
cask "font-udev-gothic-nf"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "ik-product-manager"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "keepassxc"
cask "keepingyouawake"
cask "keyclu"
cask "logi-options+"
cask "native-access"
cask "notion"
cask "postman"
cask "raycast"
cask "scroll-reverser"
cask "session-manager-plugin"
cask "skype"
cask "slack"
cask "steinberg-download-assistant"
cask "visual-studio-code"
cask "vlc"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "christian-kohler.path-intellisense"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
