tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "xz"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "readline"
brew "asdf"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "gettext"
brew "glib"
brew "libunistring"
brew "libidn2"
brew "openldap"
brew "curl"
brew "direnv"
brew "libevent"
brew "unbound", restart_service: true
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "ffmpeg"
brew "fish"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "guile"
brew "httpstat"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "luv"
brew "mas"
brew "openjdk"
brew "maven"
brew "msgpack"
brew "neovim"
brew "peco"
brew "pwgen"
brew "rcm"
brew "sbt"
brew "scala"
brew "starship"
brew "terminal-notifier"
brew "tig"
brew "wget"
cask "alfred"
cask "authy"
cask "cheatsheet"
cask "clipy"
cask "cursor"
cask "discord"
cask "docker"
cask "font-fira-code-nerd-font"
cask "forticlient-vpn"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "keepassxc"
cask "keepingyouawake"
cask "musescore"
cask "postman"
cask "visual-studio-code"
cask "vlc"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "Angular.ng-template"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.LiveServer"
vscode "steoates.autoimport"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
