tap "argon/mas"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "openssl"
brew "readline"
brew "asdf"
brew "gdbm"
brew "sqlite"
brew "xz"
brew "python"
brew "awscli"
brew "curl"
brew "go"
brew "dep"
brew "direnv"
brew "pcre2"
brew "fish"
brew "gettext"
brew "git"
brew "glib"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gradle"
brew "httpstat"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jo"
brew "oniguruma"
brew "jq"
brew "libpq"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "luajit"
brew "maven"
brew "msgpack"
brew "mycli"
brew "neovim"
brew "peco"
brew "pgcli"
brew "pwgen"
brew "redis"
brew "sbt"
brew "scala"
brew "solr"
brew "starship"
brew "terminal-notifier"
brew "tig"
brew "wget"
brew "argon/mas/mas"
brew "thoughtbot/formulae/rcm"
cask "adoptopenjdk8"
cask "alfred"
cask "amazon-photos"
cask "amethyst"
cask "appcleaner"
cask "atom"
cask "authy"
cask "ccleaner"
cask "cheatsheet"
cask "clip-studio-paint"
cask "clipy"
cask "discord"
cask "docker"
cask "flux"
cask "font-fira-code"
cask "fork"
cask "forticlient"
cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "java"
cask "keepassxc"
cask "keepingyouawake"
cask "musescore"
cask "parallels"
cask "postman"
cask "slack"
cask "soundflower"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
