brew "bat"
brew "chezmoi"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "libuv"
brew "gemini-cli"
brew "libunistring"
brew "gettext"
brew "ghq"
brew "git"
brew "jq"
brew "luv"
brew "mise"
brew "unibilium"
brew "neovim"
brew "peco"
brew "readline"
brew "starship"
brew "terminal-notifier"
brew "tig"
cask "appcleaner"
cask "bitwarden"
cask "chatgpt"
cask "cursor"
cask "devtoys"
cask "discord"
cask "dockdoor"
cask "docker-desktop"
cask "font-udev-gothic-nf"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "ik-product-manager"
cask "inkscape"
cask "inmusic-software-center"
cask "iterm2"
cask "izotope-product-portal"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "keepingyouawake"
cask "keyclu"
cask "kiro"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "native-access"
cask "notion"
cask "obs"
cask "obsidian"
cask "onyx"
cask "postman"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "stats"
cask "steinberg-download-assistant"
cask "visual-studio-code"
cask "warp"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "saoudrizwan.claude-dev"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
