tap "pakerwreah/calendr"
brew "bat"
brew "libunistring"
brew "gettext"
brew "chezmoi"
brew "readline"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "libuv"
brew "gemini-cli"
brew "ghq"
brew "git"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "luv"
brew "mas"
brew "mise"
brew "unibilium"
brew "neovim"
brew "starship"
brew "terminal-notifier"
brew "tig"
brew "yt-dlp"
cask "bitwarden"
cask "calendr"
cask "cursor"
cask "devtoys"
cask "discord"
cask "disk-drill"
cask "dockdoor"
cask "docker-desktop"
cask "font-udev-gothic-nf"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "ik-product-manager"
cask "iterm2"
cask "jordanbaird-ice"
cask "keepingyouawake"
cask "keyclu"
cask "logi-options+"
cask "microsoft-auto-update"
cask "motu-m-series"
cask "musescore"
cask "native-access"
cask "notion"
cask "obsidian"
cask "onyx"
cask "pearcleaner"
cask "postman"
cask "raycast"
cask "scroll-reverser"
cask "spitfire-audio"
cask "stats"
cask "steam"
cask "steinberg-download-assistant"
cask "visual-studio-code"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "saoudrizwan.claude-dev"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
