oh-my-fish/theme-agnoster
fisherman/autoenvstack
0rax/fish-bd
oh-my-fish/plugin-direnv
fisherman/done
fisherman/getopts
fisherman/humanize_duration
oh-my-fish/plugin-peco
oh-my-fish/plugin-tab
fisherman/z
